In [2]:
import numpy as np
import pandas as pd

## Missing Data

In [2]:
d = {'A': [1,2,np.nan], 'B': [1,np.nan,3], 'C': [1,2,3]}

df = pd.DataFrame(d)

In [3]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  3.0  3

In [4]:
# Drop any rows with null values

df.dropna()

     A    B  C
0  1.0  1.0  1

In [5]:
df.dropna(axis=1) # By column

   C
0  1
1  2
2  3

In [6]:
df.fillna('FILL')

      A     B  C
0     1     1  1
1     2  FILL  2
2  FILL     3  3

In [7]:
df['A'].fillna(df['A'].mean()) 

# Fill in missing values in the A column with the mean of that column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

In [8]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'], 
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 250]}

In [9]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    250

In [10]:
byComp = df.groupby('Company')
byComp

In [11]:
byComp.mean()

         Sales
Company
FB       246.5
GOOG     160.0
MSFT     232.0

In [12]:
byComp.sum()

         Sales
Company
FB         493
GOOG       320
MSFT       464

In [13]:
byComp.sum().loc['FB']

Sales    493
Name: FB, dtype: int64

In [14]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging and Joining

In [15]:
df1 = pd.DataFrame(np.ones((3,3)))
df2 = pd.DataFrame(np.zeros((3,3)))

In [16]:
df1

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [17]:
df2

     0    1    2
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

In [18]:
pd.concat([df1, df2])

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

In [19]:
d1 = {"A": [1,2,3,4], "B": [5,6,7,8], 'key': ['a','b','c','d']}
d2 = {"A": [9,10,11,12], "B": [13,14,15,16], "key": ['a','b','c','d']}

In [20]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [21]:
df1

   A  B key
0  1  5   a
1  2  6   b
2  3  7   c
3  4  8   d

In [22]:
df2

    A   B key
0   9  13   a
1  10  14   b
2  11  15   c
3  12  16   d

In [23]:
pd.merge(df1, df2, how='inner', on='key') 
#inner is default, but you will need to specify which column to merge on

   A_x  B_x key  A_y  B_y
0    1    5   a    9   13
1    2    6   b   10   14
2    3    7   c   11   15
3    4    8   d   12   16

## Operations

In [24]:
df1.head()

   A  B key
0  1  5   a
1  2  6   b
2  3  7   c
3  4  8   d

In [27]:
df1['A'].unique() # Array of unique values

array([1, 2, 3, 4])

In [28]:
df1['A'].value_counts()

4    1
3    1
2    1
1    1
Name: A, dtype: int64

In [29]:
def times2(x):
    return x * 2

df1['A'].apply(times2)

0    2
1    4
2    6
3    8
Name: A, dtype: int64

In [30]:
# And with a lambda...

df1['B'].apply(lambda x:x*2)

0    10
1    12
2    14
3    16
Name: B, dtype: int64

## Data Input

In [3]:
pd.read_csv('../data/bitcoin.csv').head()

,Date,Open,High,Low,Close,Volume,Market Cap
0,"Sep 22, 2017",3628.02,3758.27,3553.53,3630.70,"1,194,830,000","60,152,300,000"
1,"Sep 21, 2017",3901.47,3916.42,3613.63,3631.04,"1,411,480,000","64,677,600,000"
2,"Sep 20, 2017",3916.36,4031.39,3857.73,3905.95,"1,213,830,000","64,918,500,000"
3,"Sep 19, 2017",4073.79,4094.07,3868.87,3924.97,"1,563,980,000","67,520,300,000"
4,"Sep 18, 2017",3591.09,4079.23,3591.09,4065.20,"1,943,210,000","59,514,100,000"